Revit 2027 API
NurbSpline.SetControlPointsAndWeights Method
Set the control points, weights simultaneously.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetControlPointsAndWeights(
	IList<XYZ> ctrlPoints,
	DoubleArray weights
)
Public Sub SetControlPointsAndWeights (
	ctrlPoints As IList(Of XYZ),
	weights As DoubleArray
)
public:
void SetControlPointsAndWeights(
	IList<XYZ^>^ ctrlPoints,
	DoubleArray^ weights
)
member SetControlPointsAndWeights :
        ctrlPoints : IList<XYZ> *
        weights : DoubleArray -> unit
Parameters
ctrlPoints IList<XYZ>
weights DoubleArray
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace